app/Controllers/Api/Koafit.php

INSERT INTO `koafit` (`sport`, `level`, `time`, `kkal`, `image`, `created_at`, `updated_at`) VALUES ('Swimming', 'Normal activity', '300', '75', 'swimming.png', '2024-01-31 13:41:09', '2024-01-31 13:41:09')
---
    public function create()
    {
        $validation =  \Config\Services::validation();
        $validation->setRules([
            'sport'     => 'required',
            'level'     => 'required',
            'time'      => 'required',
            'kkal'      => 'required',
        ]);

        if (!$validation->withRequest($this->request)->run()) {
            return $this->failValidationErrors($validation->getErrors());
        }
        $image = $this->request->getFile('image');
        if (!$image->isValid() || !in_array($image->getExtension(), ['jpg', 'jpeg', 'png', 'gif'])) {
            return $this->fail('Invalid file type. Only JPG, JPEG, PNG, or GIF files are allowed.');
        }
        $imageName = $image->getRandomName();
        try {
            $img = \Config\Services::image();
            $image->move("./image/koafit/", $imageName);
            $img->withFile("./image/koafit/$imageName")->resize(1080, 1280, true)->save("./image/koafit/$imageName", 80);